In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('emp.csv')
df.head()

   EmployeeID    Name   Age  Gender Department   Salary JoiningDate
0         101   Rahul  25.0    Male         IT  45000.0  2021-06-15
1         102   Priya  29.0  Female         HR  48000.0  2020-03-10
2         103    Amit   NaN    Male    Finance  52000.0  2019-11-01
3         104    Neha  32.0  Female         IT      NaN  2018-07-23
4         105  Suresh  45.0    Male      Admin  60000.0  2015-01-12

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   20 non-null     int64
 1   Name         20 non-null     object
 2   Age          16 non-null     float64
 3   Gender       20 non-null     object
 4   Department   20 non-null     object
 5   Salary       17 non-null     float64
 6   JoiningDate  18 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 1.2+ KB

In [9]:
#their is thw missing value in age joindate and salary

In [8]:
df.describe()

       EmployeeID        Age        Salary
count    20.00000  16.000000     17.000000
mean    110.50000  33.062500  50705.882353
std       5.91608   6.308394   5474.540002
min     101.00000  25.000000  42000.000000
25%     105.75000  28.000000  47000.000000
50%     110.50000  31.500000  50000.000000
75%     115.25000  36.500000  54000.000000
max     120.00000  45.000000  62000.000000

In [10]:
# cheacking missing values
df.isnull().sum()

EmployeeID     0
Name           0
Age            4
Gender         0
Department     0
Salary         3
JoiningDate    2
dtype: int64

In [32]:
# handling missing values by filling with mean for salary and age and median for joindate
df.fillna(
    {
        'Age': df['Age'].mean(),
        'Salary': df['Salary'].mean()
    },
    inplace=True
)

In [20]:
#check the duplicate values
df.duplicated().sum()

np.int64(0)

In [ ]:
#Data Type Conversion
df['JoiningDate'] = pd.to_datetime(df['JoiningDate'], errors='coerce')

In [34]:
df.fillna(
    {
        'JoiningDate': df['JoiningDate'].median()
    },
    inplace=True
)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   20 non-null     int64
 1   Name         20 non-null     object
 2   Age          20 non-null     float64
 3   Gender       20 non-null     object
 4   Department   20 non-null     object
 5   Salary       20 non-null     float64
 6   JoiningDate  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 1.2+ KB

#New Clean data set

In [36]:
df.head()

   EmployeeID    Name      Age  Gender Department        Salary JoiningDate
0         101   Rahul  25.0000    Male         IT  45000.000000  2021-06-15
1         102   Priya  29.0000  Female         HR  48000.000000  2020-03-10
2         103    Amit  33.0625    Male    Finance  52000.000000  2019-11-01
3         104    Neha  32.0000  Female         IT  50705.882353  2018-07-23
4         105  Suresh  45.0000    Male      Admin  60000.000000  2015-01-12

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   20 non-null     int64
 1   Name         20 non-null     object
 2   Age          20 non-null     float64
 3   Gender       20 non-null     object
 4   Department   20 non-null     object
 5   Salary       20 non-null     float64
 6   JoiningDate  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 1.2+ KB